* Select part number
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database workshop
:END:
** We want to grab all parts that have a part_number that starts with 3. Write a SELECT query to get this information. This table may show all attributes of the parts table.

#+BEGIN_SRC sql
  SELECT *
    FROM parts
   WHERE part_number::text LIKE '3%';
#+END_SRC

#+RESULTS:
| id | part_number | device_id |
|----+-------------+-----------|
|  3 |           3 |         1 |
